Repository: mrkt365/candidate-website
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: es

source: %{name}'s Platform
es: Mi Plataforma

source: ¿Español?
es: English?

source: es
es: en

source: About
es: Acerca

source: Attend an Upcoming Event
es: Asiste A Un Evento

source: Check all options you're interested in and we'll provide details for each once we know you're in
es: Fíjate en todas las opciones en las que tienes interés y te pasamos detalles para cada una una vez que sepamos que te has sumado

source: Contribute
es: Donar

source: Democracy is Powered by Volunteers Like You
es: La Democracia Existe Por Voluntarios Como Tú

source: Details / RSVP
es: Detalles / RSVP

source: Donate to My Campaign
es: Doná a mi campaña

source: Email
es: Correo electrónico

source: Endorsed By:
es: Respaldada Por:

source: Endorsements
es: Patrocinios

source: Events
es: Eventos

source: For info and updates
es: Para información y apuntes

source: Host An Event for
es: Sé Anfitrión De Evento Para

source: How Will You Help?
es: ¿Cómo vas a ayudar?

source: Issues
es: Temas

source: JOIN ME
es: SÚMATE

source: More on This
es: Más información

source: Name
es: Nombre

source: News
es: Noticias

source: Offices
es: Oficinas

source: Phone
es: Número Telefónico

source: Press
es: Prensa

source: Read More About Me Here
es: Lea Mi Plataforma Electoral

source: Read My Full Platform
es: Lea Mi Plataforma Electoral

source: Recent News
es: Noticias Recientes

source: Store
es: Tienda

source: Tweets by Ocasio2018
es: Tweets por Ocasio2018

source: Visit Map
es: Visitá el mapa

source: Visit our
es: Visitá las

source: Why Support Alexandria?
es: ¿Por Qué Debo Apoyar A Alexandria?

source: Zip
es: Código Postal

source: and
es: y

source: Volunteer
es: Voluntarios

source: Early Life
es: Los Primeros Años

source: Experience
es: Experiencia Práctica

source: Meet
es: Conoce a

source: Moving Forward
es: Sigamos Adelante!
